
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	РаскидатьАдреса();
КонецПроцедуры

Процедура РаскидатьАдреса()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Адреса.Ссылка,
		|	Адреса.ФиасКодРегиона,
		|	Адреса.РегионСТипом,
		|	Адреса.ФиасКодРайонаВРегионе,
		|	Адреса.РайонВРегионеСТипом,
		|	Адреса.ФиасКодГорода,
		|	Адреса.ГородСТипом,
		|	Адреса.Родитель КАК РайонГородРегиона,
		|	Адреса.Родитель.Родитель КАК Регион
		|ИЗ
		|	Справочник.Адреса КАК Адреса
		|ГДЕ
		|	НЕ Адреса.ЭтоГруппа
		//|	И Адреса.Родитель = ЗНАЧЕНИЕ(Справочник.Адреса.Пустаяссылка)
		|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		лРегион = КэшФункцииВызов.ПолучитьРегион(Выборка.ФиасКодРегиона,Выборка.РегионСТипом);
		
		Если ЗначениеЗаполнено(Выборка.ФиасКодРайонаВРегионе)  Тогда
			лРайонГородРегиона = КэшФункцииВызов.ПолучитьРайонРегиона(лРегион,Выборка.ФиасКодРайонаВРегионе,Выборка.РайонВРегионеСТипом);	
		ИначеЕсли ЗначениеЗаполнено(Выборка.ФиасКодГорода) Тогда 
			лРайонГородРегиона = КэшФункцииВызов.ПолучитьГородРегиона(лРегион,Выборка.ФиасКодГорода,Выборка.ГородСТипом);	
		Иначе
			лРайонГородРегиона = Неопределено;
		КонецЕсли; 
		
		Если (Выборка.Регион <> лРегион) или (Выборка.РайонГородРегиона <> лРайонГородРегиона) Тогда
			лАдрес = Выборка.Ссылка.ПолучитьОбъект();
			лАдрес.Родитель = лРайонГородРегиона;
			лАдрес.Записать();
		КонецЕсли; 
	КонецЦикла;
		
КонецПроцедуры
 