
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОтправитьАдресаВЦБ();
	ПоказатьОповещениеПользователя("Обработка завершена");
КонецПроцедуры

Процедура ОтправитьАдресаВЦБ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Адреса.Ссылка,
		|	Адреса.ДатаОтправкиВЦБ,
		|	Адреса.ДатаЗапросаДадата,
		|	Адреса.СтандартизованныйАдрес
		|ИЗ
		|	Справочник.Адреса КАК Адреса
		|ГДЕ
		|	Адреса.КодПроверкиАдреса = ""0""
		|	И Адреса.ДатаЗапросаДадата <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И Адреса.ДатаОтправкиВЦБ = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И НЕ Адреса.ПометкаУдаления
		|	И НЕ Адреса.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	лАдреса = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	Модуль77.ОтправитьАдресаВЦБ(лАдреса);
		
КонецПроцедуры
 