
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.Адреса.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ОтправитьАдресаВЦБ(ПараметрКоманды);
КонецПроцедуры

Процедура ОтправитьАдресаВЦБ(пАдреса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Адреса.ИсходныйАдрес,
		|	Адреса.ИД,
		|	Адреса.ГЛН
		|ИЗ
		|	Справочник.Адреса КАК Адреса
		|ГДЕ
		|	Адреса.Ссылка В(&пАдреса)
		|	И НЕ Адреса.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("пАдреса", пАдреса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	лБаза = КэшФункции.ПолучитьКомСоединение();
	лАдрес77 = лБаза.CreateObject("Справочник.Адреса");
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		лИД = СтрЗаменить(Выборка.ИД,"""","""""");
		лСсылкаНаАдрес77 = лБаза.EvalExpr("ЗначениеИзСтрокиВнутр("""+лИД+""")");
		
		лАдрес77.НайтиЭлемент(лСсылкаНаАдрес77);
		
		лАдрес77.Поле1 = Выборка.ГЛН;
		лАдрес77.Записать();
	КонецЦикла;
КонецПроцедуры
 