
Функция ПолучитьКомСоединение() Экспорт
	База = Новый COMОбъект("v77.Application");
	
	
	СтрокаПодключения = "/D""" + Константы.КаталогИБ.Получить() + """" + 
						" /N""" + Константы.ПользовательИБ.Получить() + """" +
						" /P""" + Константы.ПарольПользователяИБ.Получить() + """";

	Попытка
		РезультатПодключения = База.Initialize(База.RMTrade,СтрокаПодключения,"NO_SPLASH_SHOW");
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат 0;
	КонецПопытки; 

	Если НЕ РезультатПодключения Тогда
	    Сообщить("Не удалось произвести подключение к информационной базе.");
		Возврат 0;
	Иначе
		Возврат База;
	КонецЕсли;
		
КонецФункции

