
Функция ПолучитьОбъект77(пБаза,пМетаданные77,пИД = Неопределено)Экспорт
	лОбъект = пБаза.CreateObject(пМетаданные77);
	
	Если пИД <> Неопределено Тогда
		лИД = СтрЗаменить(пИД,"""","""""");
		лСсылка = пБаза.EvalExpr("ЗначениеИзСтрокиВнутр("""+лИД+""")");
		лОбъект.НайтиЭлемент(лСсылка);
	КонецЕсли; 
	
	Возврат лОбъект;
КонецФункции
 
Функция ПолучитьСсылку77(пБаза,пИД)Экспорт
	лИД = СтрЗаменить(пИД,"""","""""");
	лСсылка = пБаза.EvalExpr("ЗначениеИзСтрокиВнутр("""+лИД+""")");
	
	Возврат лСсылка;
КонецФункции
