
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	лКоличествоОбновлено = 0;
	лКоличествоПропущено = 0;
	РаспознатьЧерезСервисДадата(лКоличествоОбновлено,лКоличествоПропущено);
	ПоказатьОповещениеПользователя("Обновлено адресов: " + лКоличествоОбновлено + "
									|Пропущено: " + лКоличествоПропущено);
КонецПроцедуры

// Ограничения сервиса максимум 50 записей по 3 адреса
Процедура РаспознатьЧерезСервисДадата(пКоличествоОбновлено,пКоличествоПропущено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Адреса.Ссылка,
		|	Адреса.ИсходныйАдрес,
		|	Адреса.ДатаЗагрузкиИзЦБ,
		|	Адреса.ДатаЗапросаДадата
		|ИЗ
		|	Справочник.Адреса КАК Адреса
		|ГДЕ
		|	Адреса.ДатаЗапросаДадата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И НЕ Адреса.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	лАдреса = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если СтрДлина(Выборка.ИсходныйАдрес)>15 Тогда
			лАдреса.Добавить(Выборка.Ссылка);
			пКоличествоОбновлено = пКоличествоОбновлено + 1;
		Иначе
			пКоличествоПропущено = пКоличествоПропущено + 1;
		КонецЕсли;
		
		Если лАдреса.Количество()= 150 Тогда
			СервисДадата.РаспознатьЧерезСервисДадата150(лАдреса);
			лАдреса.Очистить();
		КонецЕсли; 
	КонецЦикла;
	
	Если лАдреса.Количество() <> 0 Тогда
		СервисДадата.РаспознатьЧерезСервисДадата150(лАдреса);
		лАдреса.Очистить();
	КонецЕсли; 
	
КонецПроцедуры

