
Функция ПолучитьРегион(КодФИАС,НаименованиеРегиона) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Адреса.Ссылка
		|ИЗ
		|	Справочник.Адреса КАК Адреса
		|ГДЕ
		|	Адреса.ЭтоГруппа
		|	И Адреса.ФиасКодРегиона = &КодФИАС";
	
	Запрос.УстановитьПараметр("КодФИАС", КодФИАС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		лРегион = Справочники.Адреса.СоздатьГруппу();
		лРегион.Наименование = НаименованиеРегиона;
		лРегион.ФиасКодРегиона = КодФИАС;
		лРегион.Записать();
		
		Результат = лРегион.Ссылка;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции
 
Функция ПолучитьГородРегиона(пРегион,КодФИАС,НаименованиеГорода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Адреса.Ссылка
		|ИЗ
		|	Справочник.Адреса КАК Адреса
		|ГДЕ
		|	Адреса.ЭтоГруппа
		|	И Адреса.ФиасКодГорода = &КодФИАС";
	
	Запрос.УстановитьПараметр("КодФИАС", КодФИАС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		лРегион = Справочники.Адреса.СоздатьГруппу();
		лРегион.Наименование = НаименованиеГорода;
		лРегион.Родитель = пРегион;
		лРегион.ФиасКодГорода = КодФИАС;
		лРегион.Записать();
		
		Результат = лРегион.Ссылка;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции

Функция ПолучитьРайонРегиона(пРегион,КодФИАС,НаименованиеРайона) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Адреса.Ссылка
		|ИЗ
		|	Справочник.Адреса КАК Адреса
		|ГДЕ
		|	Адреса.ЭтоГруппа
		|	И Адреса.ФиасКодРайонаВРегионе = &КодФИАС";
	
	Запрос.УстановитьПараметр("КодФИАС", КодФИАС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		лРегион = Справочники.Адреса.СоздатьГруппу();
		лРегион.Наименование = НаименованиеРайона;
		лРегион.Родитель = пРегион;
		лРегион.ФиасКодРайонаВРегионе = КодФИАС;
		лРегион.Записать();
		
		Результат = лРегион.Ссылка;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции
