
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	лОтвет = "";
	РаспознатьЧерезСервисДадата150(ПараметрКоманды,лОтвет);
	
	//лТекст = Новый ТекстовыйДокумент;
	//лТекст.УстановитьТекст(лОтвет);
	//лТекст.Показать(); 
КонецПроцедуры

// Ограничения сервиса максимум 50 записей по 3 адреса
Процедура РаспознатьЧерезСервисДадата150(пАдреса,пОтвет = Неопределено)
	
	лСоот = СервисДадата.ПолучитьСоответсвияРеквизитовАдресов();
	
	лСтрокаЖСОН = СервисДадата.ПолучитьСтрокуЗапросаЖСОН150(пАдреса);
	
	лОтветЖСОН = СервисДадата.ОтправитьЗапрос(лСтрокаЖСОН);
	
	//пОтвет = 	"__________________________ЗАПРОС:
	//			|" + лСтрокаЖСОН + "
	//			|__________________________ОТВЕТ:
	//			|" + лОтветЖСОН;
				
	ЧтениеЖСОН = Новый ЧтениеJSON;
	ЧтениеЖСОН.УстановитьСтроку(лОтветЖСОН);
	
	ОтветСтруктурой = ПрочитатьJSON(ЧтениеЖСОН);
	
	лМассивЗаписей = ОтветСтруктурой.data;	// в записи по три адреса
	
	Для каждого лЗапись Из лМассивЗаписей Цикл
		
		Для каждого лКолонкаЗаписи Из лЗапись Цикл
			Для лСч = 0 По 2 Цикл
				лКодАдреса = лЗапись[лСч * 2].source;
				лРезультатРаспознания = лЗапись[лСч * 2 + 1];
				
				лТекущийАдрес = Справочники.Адреса.НайтиПоКоду(лКодАдреса);
				Если ЗначениеЗаполнено(лТекущийАдрес) Тогда
					лТекущийАдрес = лТекущийАдрес.ПолучитьОбъект();
					
					лЗаполняемыеРеквизитыАдреса = Новый Структура;
					
					Для каждого лРеквизит Из лСоот Цикл
						лЗначениеСвойства = Неопределено;
						Если лРезультатРаспознания.Свойство(лРеквизит.Ключ,лЗначениеСвойства) Тогда
							лЗаполняемыеРеквизитыАдреса.Вставить(лРеквизит.Значение,лЗначениеСвойства);
						КонецЕсли; 
					КонецЦикла; 
					
					ЗаполнитьЗначенияСвойств(лТекущийАдрес,лЗаполняемыеРеквизитыАдреса);
					лТекущийАдрес.ДатаЗапросаДадата = ТекущаяДата();
					
					лТекущийАдрес.Записать();
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры

